
export default () => {
  return (
    <div className="flex gap-2 flex-col">
      <h1 className="text-2xl  ">Информация</h1>
      <p>
        Это тестовая версия листа персонажа, в отображении могут возникать
        ошибки, но это не очень страшно, потому что вы можете изменять размер
        каждого из окон, а также перемещать их внутри листа.
      </p>
      <p className="font-bold text-xl ">Сохраняй лист персонажа, авто сейва пока нет!</p>
      <p>
        Если что-то пошло не так, можно нажать на круглик и блоки перерасчитают
        свое положение.
      </p>
      <h1></h1>
    </div>
  );
};
