export const advantages = [
  {
    title: "Прочный",
    description: "Хиты этого предмета увеличиваются в три раза.",
  },
  {
    title: "Лёгкое",
    description:
      "Этот предмет весит вдвое меньше обычного без ущерба для его прочности или потенциала при нанесении урона. Если это оружие со свойством тяжёлое, то оно теряет это свойство. Если оно не имеет этого свойства, оно приобретает свойство лёгкое.",
  },
  {
    title: "Великолепная поделка",
    description:
      "Этот предмет выглядит потрясающе, и он стоит вдвое больше своей обычной стоимости.",
  },
  {
    title: "Броский",
    description:
      "Этот предмет выглядит очень круто. Бонусным действием вы можете сделать ацент на этой вещи, что позволит получить преимущество на проверку убеждения/выступления, если демонстрация предмета может оказать эффект на наблюдателя",
  },
  {
    title: "Походный",
    description:
      "Если этот предмет является одеждой или доспехами, вы получаете преимущество при спасбросках Телосложения против эффектов окружающей среды, вызванных холодной погодой.",
  },
  {
    title: "Ухватистый",
    description:
      "Вы получаете преимущество при проверке характеристик и спасбросках, чтобы противостоять обезоруживанию (только этот предмет), или если он будет отобран у вас против вашей воли. Если предмет не является ни удерживаемым предметом, ни оружием, совершите повторный бросок по таблице.",
  },
  {
    title: "Быстрый",
    description:
      "Если этот предмет является доспехами или щитом, его можно быстро надеть или снять. Время на надевание или снятие этого предмета осуществляется в десять раз быстрее (щит требует либо бонусного действия, либо действия). Если это не доспехи, ни щит, совершите повторный бросок по таблице.",
  },
  {
    title: "Идеальный Баланс",
    description:
      "Если этот предмет является оружием, каждый раз, когда вы бросаете 1 на к20 при совершении атаки, вы можете перебросить к20 и должны использовать новый результат. Если этот предмет - доспехи или одежда, то при броске 1 на к20, когда вы совершаете проверку по Ловкости (Акробатике) или спасбросок по Ловкости, вы можете перебросить к20 и должны использовать новый результат. Если это не оружие, ни одежда и ни доспехи, совершите повторный бросок по таблице.",
  },
  {
    title: "Мастерство Ремесленника",
    description:
      "Если этот предмет является оружием, он получает бонус +1 к броскам на урон. Если это доспехи, то урон колющий, дробящий и рубящий урон от немагических атак, которые вы получаете, уменьшается на 1. Если это не доспехи и не оружие, совершите повторный бросок по таблице.",
  },
  {
    title: "Двухлезвийное",
    description:
      "Кость урона уменьшается на 1 ступень (- к2). Получает особое свойство: сразу после атаки вы можете бонусным действием совершить еще одну рукопашную атаку этим оружием, нанося 1к4 рубящего урона при попадании.",
  },
  {
    title: "Рунический",
    description:
      "Оружие или доспех имеет ячейку для установки магической руны или изготовлено из материала, который можно зачаровать.",
  },
  {
    title: "Утяжеленное",
    description:
      "Если оружие имело свойство Лёгкое, оно теряет его. Если у оружия не было свойства Легкое, оно получает свойство Тяжёлое (12). Если эффект перемещает вас против вашей воли по земле, вы можете использовать реакцию, чтобы уменьшить дистанцию перемещения на 10 футов. Вес доспеха увеличивается на 50%.",
  },
];

export const disadvantages = [
  {
    title: "Плохая/Некачественная/Ужасная Ручная работа",
    description:
      'Этот предмет плохо сделан. Если этот предмет является оружием, он имеет штраф -1 к броскам атаки и урона. Если это доспехи, то они имеют штраф -1 к базовому КД. Если это не является ни доспехами, ни оружием, оно получает причуду "Хрупкость".',
  },
  {
    title: "Хрупкий",
    description:
      "Этот предмет склонен к поломкам. Если предмет является оружием, то при броске 1 на к20 для атаки с помощью этого предмета, оружие ломается. Если предмет не является оружием, каждый раз, когда вы получаете критическое попадание, предмет сломается и больше не будет пригоден к использованию, если вы несёте более одного предмета, сломается 1 на выбор мастера.",
  },
  {
    title: "Громоздкий",
    description:
      "Этот предмет плохо сбалансирован или мешает вам двигаться. Если вы атакуете этим оружием или совершаете спасбросок по Ловкости или проверку Ловкости (Акробатика) когда носите или несёте его и при этом выпадает 1 на к20, то это чревато последствиями. Если предмет является оружием, он отлетает на 10 футов в случайном направлении. Если предмет не является оружием, вы падаете ничком.",
  },
  {
    title: "Шумный",
    description:
      "Что-то в этом предмете скрипит или шуршит. У вас помеха при проверках по Ловкости (Скрытности), пока вы носите или несете этот предмет, даже если он убран.",
  },
  {
    title: "Тяжелый",
    description: "Этот предмет весит в два раза больше обычного.",
  },
  {
    title: "Пёстрый",
    description:
      "Дизайн и цвета этого предмета просто неправильные. Пока вы носите или держите этот предмет, вы совершаете с помехой проверки по Харизме (Запугивании) против существ, которые могут видеть этот предмет.",
  },
  {
    title: "Посредственная Поделка",
    description:
      "Этот предмет выглядит отвратительно и стоит только половину своей нормальной стоимости.",
  },
  {
    title: "Неудачный",
    description:
      "Когда вы атакуете этим предметом, носите эту одежду или броню, или когда вы держите этот предмет, диапазон значений, приводящих к критическому провалу, увеличивается на 1 (например, с результата 1 до результата 1–2 на к20).",
  },
];

export const PROBABILITY_MATRIX: Record<number, Record<string, number>> = {
  0: {
    "Низкое (2 недостатка)": 90,
    "Ниже среднего (1 недостаток)": 10,
  },
  1: {
    "Низкое (2 недостатка)": 60,
    "Ниже среднего (1 недостаток)": 30,
    "Среднее (без свойств)": 10,
  },
  2: {
    "Низкое (2 недостатка)": 20,
    "Ниже среднего (1 недостаток)": 50,
    "Среднее (без свойств)": 20,
    "Хорошее (1 преимущество)": 10,
  },
  3: {
    "Ниже среднего (1 недостаток)": 20,
    "Среднее (без свойств)": 50,
    "Хорошее (1 преимущество)": 20,
    "Отличное (Качество +1, 1 преимущество)": 10,
  },
  4: {
    "Хорошее (1 преимущество)": 50,
    "Отличное (Качество +1, 1 преимущество)": 20,
    "Превосходное (+1, 2 преимущества)": 10,
    "Среднее (без свойств)": 20,
  },
  5: {
    "Хорошее (1 преимущество)": 20,
    "Отличное (Качество +1, 1 преимущество)": 50,
    "Превосходное (+1, 2 преимущества)": 20,
    "Легендарное (+2, 2 преимущества)": 10,
  },
};

export const DURABILITY_MAP: Record<string, number> = {
  "Низкое (2 недостатка)": 2,
  "Ниже среднего (1 недостаток)": 2,
  "Среднее (без свойств)": 3,
  "Хорошее (1 преимущество)": 4,
  "Отличное (Качество +1, 1 преимущество)": 4,
  "Превосходное (+1, 2 преимущества)": 5,
  "Легендарное (+2, 2 преимущества)": 5,
};
